const translate = {
	qj_caocao: "曹操",
	qj_simayi: "司马懿",
	qj_xiahoudun: "夏侯惇",
	qj_zhangliao: "张辽",
	qj_xuchu: "许褚",
	qj_guojia: "郭嘉",
	qj_zhenji: "甄姬",
	qj_xiahouyuan: "夏侯渊",
	qj_zhanghe: "张郃",
	qj_xuhuang: "徐晃",
	qj_caoren: "曹仁",
	qj_dianwei: "典韦",
	qj_xunyu: "荀彧",
	qj_caopi: "曹丕",
	qj_yuejin: "乐进",
	qj_liubei: "刘备",
	qj_guanyu: "关羽",
	qj_zhangfei: "张飞",
	qj_zhugeliang: "诸葛亮",
	qj_zhaoyun: "赵云",
	qj_machao: "马超",
	qj_huangyueying: "黄月英",
	qj_huangzhong: "黄忠",
	qj_weiyan: "魏延",
	qj_pangtong: "庞统",
	qj_wolong_zhugeliang: "卧龙诸葛亮",
	qj_liushan: "刘禅",
	qj_menghuo: "孟获",
	qj_zhurongfuren: "祝融夫人",
	qj_ganfuren: "甘夫人",
	qj_sunquan: "孙权",
	qj_ganning: "甘宁",
	qj_lvmeng: "吕蒙",
	qj_huanggai: "黄盖",
	qj_zhouyu: "周瑜",
	qj_daqiao: "大乔",
	qj_luxun: "陆逊",
	qj_sunshangxiang: "孙尚香",
	qj_sunjian: "孙坚",
	qj_xiaoqiao: "小乔",
	qj_taishici: "太史慈",
	qj_zhoutai: "周泰",
	qj_lusu: "鲁肃",
	qj_zhangzhao: "张昭",
	qj_dingfeng: "丁奉",
	qj_huatuo: "华佗",
	qj_lvbu: "吕布",
	qj_diaochan: "貂蝉",
	qj_yuanshao: "袁绍",
	qj_yanliangwenchou: "颜良&文丑",
	qj_jiaxu: "贾诩",
	qj_pangde: "庞德",
	qj_zhangjiao: "张角",
	qj_caiwenji: "蔡文姬",
	qj_mateng: "马腾",
	qj_jiling: "纪灵",
	qj_tianfeng: "田丰",
	qj_panfeng: "潘凤",
	qj_zoushi: "邹氏",
	qj_hansui: "韩遂",
	qj_simayan: "司马炎",
	qj_simashi: "司马师",
	qj_simazhao: "司马昭",
	qj_jiachong: "贾充",
	qj_yanghu: "羊祜",
	qj_wangyuanji: "王元姬",
	qj_xiahouhui: "夏侯徽",
	qj_jin_simayi: "司马懿",
	qj_zhangchunhua: "张春华",
	qj_zhanghuyuechen: "张虎&乐綝",
	qj_yanghuiyu: "羊徽瑜",
	qj_wangjun: "王濬",
	qj_wenyang: "文鸯",
	qj_shibao: "石苞",
	qj_zhanghua: "张华",
	qj_liuxie: "刘协",
	qj_liubian: "刘辩",
	qj_zhangrang: "张让",
	qj_hejin: "何进",
	qj_wangyun: "王允",
	qj_wangrong: "王荣",
	qj_fuhuanghou: "伏皇后",
	qj_fuwan: "伏完",
	qj_dongcheng: "董承",
	qj_tangji: "唐姬",
	qj_caiyong: "蔡邕",
	qj_huangfusong: "皇甫嵩",
	qj_liuchongluojun: "刘宠&骆俊",
	qj_liuyao: "刘繇",
	qj_jianshuo: "蹇硕",
	yc_niujin: "牛金",
	yc_zhoucang: "周仓",
	yc_quexiaojiang: "曲阿小将",
	yc_wenhu: "文虎",
	yc_mushun: "穆顺",
	yc_huweijun: "虎卫军",
	yc_baimayicong: "白马义从",
	yc_xiangbing: "象兵",
	yc_jinfanjun: "锦帆军",
	yc_bingzhoulangqi: "并州狼骑",
	yc_huangjinleishi: "黄巾雷使",
	yc_fuxinsishi: "腹心死士",
	yc_xiyuanjun: "西园军",

	qj_jianxiong: "奸雄",
	qj_jianxiong_info:
		"当你受到伤害后，你可以摸一张牌，然后你可以弃置一张牌，获得造成此伤害的牌。",
	qj_guicai: "鬼才",
	qj_guicai_info: "当一名角色的判定牌生效前，你可以打出一张牌代替之。",
	qj_fankui: "反馈",
	qj_fankui_info: "当你受到伤害后，你可以获得来源的一张牌。",
	qj_ganglie: "刚烈",
	qj_ganglie_info:
		"当你受到伤害后，你可以判定，若为：红色，你对伤害来源造成1点伤害；黑色，你弃置伤害来源的一张牌。",
	qj_chizhong: "持重",
	qj_chizhong_info:
		"每回合限一次，当你于摸牌阶段外得到牌后，你可以将多于体力值的手牌交给其他角色。",
	qj_tuxi: "突袭",
	qj_tuxi_info:
		"摸牌阶段，你可以少摸任意张牌并选择等量的其他角色，然后获得这些角色各一张手牌。",
	qj_luoyi: "裸衣",
	qj_luoyi_info:
		"摸牌阶段结束时，你可以弃置一张牌，然后本回合你使用【杀】或【决斗】造成的伤害+1。",
	tl_xuchu: "统领【决斗】",
	tl_xuchu_info:
		"【决斗】|虎卫军：每回合结束时，若你本回合共计造成和受到过的伤害数大于1，你可以移动场上一张牌。",
	qj_qingzi: "轻辎",
	qj_qingzi_info:
		"准备阶段，你可以弃置一名与你势力相同的其他角色装备区的一张牌，令其获得“神速”直到其回合结束。",
	qj_yiji: "遗计",
	qj_yiji_info:
		"当你受到伤害后，你可以观看牌堆顶两张牌，将其中一至两张牌交给一名角色，然后将其余的牌交给一名角色。",
	qj_luoshen: "洛神",
	qj_luoshen_info:
		"准备阶段，你可以判定，若为黑色，你可以重复此流程。然后你获得所有黑色的判定牌。",
	qj_qingguo: "倾国",
	qj_qingguo_info: "你可以将一张黑色手牌当【闪】使用或打出。",
	qj_shensu: "神速",
	qj_shensu_info:
		"你可以选择以下任意项：1.跳过判定阶段和摸牌阶段；2.跳过出牌阶段并弃置一张装备牌；3.跳过弃牌阶段并失去1点体力。每执行一项，你视为使用一张无距离限制的【杀】。",
	qj_shebian: "设变",
	qj_shebian_info: "当你失去体力后，你可以移动场上一张牌。",
	qj_qiaobian: "巧变",
	qj_qiaobian_info:
		"你可以弃置一张牌并跳过你的一个阶段（准备阶段和结束阶段除外），若为：摸牌阶段，你可以获得至多两名其他角色各一张手牌；出牌阶段，你可以移动场上的一张牌。",
	qj_duanliang: "断粮",
	qj_duanliang_info:
		"你可以将一张黑色非锦囊牌当【兵粮寸断】使用；若你本回合未造成过伤害，你使用【兵粮寸断】无距离限制。",
	qj_jiezi: "截辎",
	qj_jiezi_info: "其他角色跳过摸牌阶段后，你可以摸一张牌。",
	qj_weikui: "伪溃",
	qj_weikui_info:
		"出牌阶段限一次，你可以失去1点体力并观看一名其他角色的手牌。若其中有【闪】，则你视为对其使用一张【杀】，且本回合你计算与其距离视为1；否则你弃置其中一张牌。",
	qj_lizhan: "励战",
	qj_lizhan_info: "结束阶段，你可以令任意名已受伤的角色各摸一张牌。",
	tl_caoren: "统领 国【无懈可击】",
	tl_caoren_info:
		"国【无懈可击】（限一）|牛金：与你势力相同的角色回合结束时，你可以使用每种类别至多各一张牌，你以此法杀死角色后摸三张牌。",
	qj_qiangxi: "强袭",
	qj_qiangxi_info:
		"出牌阶段每名角色限一次，你可以失去1点体力或弃置一张武器牌，然后对你攻击范围内的一名其他角色造成1点伤害。",
	tl_dianwei: "统领【决斗】",
	tl_dianwei_info:
		"【决斗】|虎卫军：每回合结束时，若你本回合共计造成和受到过的伤害数大于1，你可以移动场上一张牌。",
	qj_quhu: "驱虎",
	qj_quhu_info:
		"出牌阶段限一次，你可以与一名体力值大于你的角色拼点，若你赢，其对其攻击范围内由你选择的另一名角色造成1点伤害；若你没赢，其对你造成1点伤害。",
	qj_jieming: "节命",
	qj_jieming_info:
		"当你受到1点伤害后，你可以令一名角色摸牌至其体力上限（至多摸至五张）。",
	qj_xingshang: "行殇",
	qj_xingshang_info:
		"其他角色死亡时，你可以获得其所有牌，无则改为回复1点体力。",
	qj_fangzhu: "放逐",
	qj_fangzhu_info:
		"当你受到伤害后，你可以令一名其他角色摸两张牌并叠置，然后其可以弃置四张牌并平置，若牌名字数之和大于7，其失去1点体力。",
	qj_xiaoguo: "骁果",
	qj_xiaoguo_info:
		"其他角色的准备阶段，你可以弃置任意张基本牌，然后其弃置装备区等量的牌（不足全弃，无牌不弃），若以此法弃置的基本牌多于装备牌，你摸一张牌并对其造成1点伤害。",
	qj_rende: "仁德",
	qj_rende_info:
		"出牌阶段每名角色限一次，你可以将任意张手牌交给一名其他角色。当你于此阶段以此法给出第二张牌后，你可以视为使用任意一种基本牌（计入次数限制）。",
	qj_wusheng: "武圣",
	qj_wusheng_info:
		"你可以将一张红色牌当【杀】使用或打出；你使用方片【杀】无距离限制;你使用红桃【杀】对装备区内有牌的目标角色造成伤害后，你可以视为对其使用一张【水淹七军】。",
	tl_guanyu: "统领【酒】",
	tl_guanyu_info:
		"【酒】（限一）|周仓：当你使用【杀】后，你可以将此【杀】或目标角色使用的【闪】交给另一名其他角色，若其以此法获得红色牌，其可以对你攻击范围内的一名角色使用一张【杀】。",
	qj_paoxiao: "咆哮",
	qj_paoxiao_info:
		"锁定技，你使用【杀】无次数限制；你于一回合内使用第二张【杀】时，你摸一张牌。",
	qj_guanxing: "观星",
	qj_guanxing_info:
		"准备阶段，你可以卜算5（角色数小于4时改为卜算3），若均置于牌堆底，你可以于结束阶段再发动此技能。",
	qj_kongcheng: "空城",
	qj_kongcheng_info:
		"主将技（阴阳鱼-1），当你失去手牌后，若你没有手牌，你可以令【杀】和【决斗】对你无效，直到你下次摸牌。",
	qj_longdan: "龙胆",
	qj_longdan_info:
		"你可以将【杀】当【闪】、【闪】当【杀】、【桃】当【酒】、【酒】当【桃】使用或打出；你以此法使用的【杀】被【闪】抵消时，你可以对另一名其他角色造成1点伤害。",
	tl_zhaoyun: "统领【无懈可击】",
	tl_zhaoyun_info:
		"【无懈可击】|白马义从：当你使用或打出【闪】时，你可以获得对方的一张牌。",
	qj_mashu: "马术",
	qj_mashu_info: "锁定技，你计算与其他角色的距离-1。",
	qj_tieji: "铁骑",
	qj_tieji_info:
		"当你使用【杀】指定一个目标后，你可以进行判定，然后令其一张明置武将牌本回合非锁定技失效，其选择一项：1.弃置与判定结果花色相同的一张牌；2.不能响应此【杀】。",
	qj_jizhi: "集智",
	qj_jizhi_info: "当你使用非转化且非虚拟的锦囊牌时，你可以摸一张牌。",
	qj_cangji: "藏机",
	qj_cangji_info:
		"每回合限一次，当你因弃置而失去装备区的一张防具或宝物牌时，你可以防止之。",
	qj_lieyong: "烈勇",
	qj_lieyong_info:
		"锁定技，你的攻击范围+X（X为你已损失的体力值，至少为1)：当你使用【杀】指定手牌数小于等于你或体力值大于等于你的目标后，你令此【杀】不能被其响应或对其伤害+1。",
	qj_kuanggu: "狂骨",
	qj_kuanggu_info:
		"当你对距离1以内的一名角色造成伤害后，你可以回复1点体力或摸一张牌，若选择项与本回合上次不同，你本回合使用【杀】的次数+1。",
	qj_lianhuan: "连环",
	qj_lianhuan_info: "你可以将一张梅花手牌当【铁索连环】使用或重铸。",
	qj_niepan: "涅槃",
	qj_niepan_info:
		"限定技，当你处于濒死状态时，你可以弃置区域里的所有牌，平置并重置你的武将牌，然后摸三张牌并回复体力至3点。",
	qj_bazhen: "八阵",
	qj_bazhen_info:
		"锁定技，若你的装备区里没有防具牌，你视为装备着【八卦阵】。",
	qj_huoji: "火计",
	qj_huoji_info:
		"你可以将一张红色手牌当【火攻】使用。",
	qj_kanpo: "看破",
	qj_kanpo_info: "你可以将一张黑色手牌当【无懈可击】使用。你抵消过牌的回合结束时，你可以观看当前回合角色的手牌。",
	qj_xiangle: "享乐",
	qj_xiangle_info:
		"锁定技，当你成为【杀】的目标后，你令使用者选择一项：1.弃置一张基本牌；2.此【杀】对你无效。",
	qj_fangquan: "放权",
	qj_fangquan_info:
		"轮次技，你可以跳过出牌阶段。若如此做，此回合结束时，你可以弃置一张手牌并选择一名其他角色，令其获得一个额外的回合。",
	qj_huoshou: "祸首",
	qj_huoshou_info:
		"锁定技，【南蛮入侵】对你无效；当【南蛮入侵】指定目标后，你成为此牌的伤害来源。",
	qj_zaiqi: "再起",
	qj_zaiqi_info:
		"弃牌阶段结束时，你可以令至多X名与你势力相同的角色依次选择一项（X为本回合置入弃牌堆的红色牌数）：1.摸一张牌；2.令你回复1点体力。",
	qj_juxiang: "巨象",
	qj_juxiang_info:
		"锁定技，【南蛮入侵】对你无效；当其他角色使用的【南蛮入侵】结算结束后，你获得之。",
	qj_lieren: "烈刃",
	qj_lieren_info:
		"当你使用【杀】对目标角色造成伤害后，你可以与其拼点，若你赢，你获得其一张牌。",
	tl_zhurongfuren: "统领【杀】",
	tl_zhurongfuren_info:
		"【杀】（无距离限制）|象兵：锁定技，当你使用【杀】后，你视为对受到此【杀】伤害的目标角色使用一张【南蛮入侵】；当你受到火焰伤害后，你视为对所有相邻角色使用一张【杀】。",
	qj_shushen: "淑慎",
	qj_shushen_info:
		"当你回复1点体力后，你可以选择一名其他角色，令其回复1点体力或与其各摸一张牌。",
	qj_shenzhi: "神智",
	qj_shenzhi_info:
		"准备阶段，你可以弃置所有手牌，然后若弃牌数大于等于体力值，你回复1点体力。",
	qj_zhiheng: "制衡",
	qj_zhiheng_info:
		"出牌阶段限一次，你可以弃置至多X张牌并摸等量的牌（X为你的体力上限）。",
	qj_qixi: "奇袭",
	qj_qixi_info: "你可以将一张黑色牌当【过河拆桥】使用。",
	tl_taishici: "统领【无懈可击】",
	tl_taishici_info:
		"【无懈可击】|锦帆军：每回合每颜色限一次，你弃置任意角色的牌后，你可以弃置一张其中包含的颜色的牌，然后摸两张牌。",
	qj_keji: "克己",
	qj_keji_info:
		"锁定技，若你未于出牌阶段内使用过颜色不同的牌，你本回合的手牌上限+4。",
	qj_mouduan: "谋断",
	qj_mouduan_info:
		"结束阶段，若你于本回合使用过四种花色或三种类别的牌，你可以移动场上一张牌，若两项均符合且你没有“涉猎”，你获得“涉猎”。",
	qj_shelie: "涉猎",
	qj_shelie_info:
		"摸牌阶段，你可以改为亮出牌堆顶的五张牌，然后获得其中任意张花色各不相同的牌。",
	qj_kurou: "苦肉",
	qj_kurou_info: "出牌阶段限一次，你可以弃置一张牌，然后失去1点体力。",
	qj_zhaxiang: "诈降",
	qj_zhaxiang_info:
		"锁定技，当你失去体力后，你摸三张牌，本回合你使用红色【杀】无距离限制且使用【杀】的次数+1。",
	qj_yingzi: "英姿",
	qj_yingzi_info:
		"锁定技，摸牌阶段，你多摸一张牌；你的手牌上限为X（X为你的体力上限）。",
	qj_fanjian: "反间",
	qj_fanjian_info:
		"主将技（阴阳鱼-1）。出牌阶段限一次，你可以展示一张手牌并交给一名其他角色，其需展示手牌且弃置你展示牌花色的所有牌（至少两张），否则失去1点体力。",
	qj_guose: "国色",
	qj_guose_info:
		"出牌阶段各限一次，你可以：1.将一张方片牌当【乐不思蜀】使用；2.弃置一张方片牌和场上一张延时锦囊牌。然后摸一张牌",
	qj_liuli: "流离",
	qj_liuli_info:
		"当你成为【杀】的目标时，你可以弃置一张牌并将此【杀】转移给攻击范围内的一名其他角色（不可为使用者或此【杀】的其他目标）。",
	qj_qianxun: "谦逊",
	qj_qianxun_info:
		"锁定技，你每回合首次成为锦囊牌的目标时，若此牌有其他未指定的合法目标，取消之。",
	qj_duoshi: "度势",
	qj_duoshi_info:
		"你可以将本回合未置入过弃牌堆的花色的一张牌当【以逸待劳】使用，然后若均已置入过，你可以令一名小势力角色选择是否将X张红色牌当【火烧连营】使用（X为目标数）。",
	qj_jieyin: "结姻",
	qj_jieyin_info:
		"出牌阶段限一次，你可以选择一名其他男性角色，弃置一张手牌或将一张装备牌置于其装备区，然后你与其之中体力值较大的角色摸一张牌，较小的角色回复1点体力。",
	qj_xiaoji: "枭姬",
	qj_xiaoji_info:
		"当你失去装备区里的牌后，你可以摸一张牌，若此时在你的回合外，改为摸两张牌。",
	qj_yinghun: "英魂",
	qj_yinghun_info:
		"准备阶段，你可以选择一名其他角色并选择一项：1.令其摸X张牌，然后弃置一张牌；2.令其摸一张牌，然后弃置X张牌（X为你已损失的体力值）。",
	qj_tianxiang: "天香",
	qj_tianxiang_info:
		"当你受到伤害时，你可以弃置一张红桃牌并防止此伤害，然后选择一名其他角色和本回合未选择过的一项：1.来源对其造成1点伤害，然后其摸等同其已损失体力值的牌（至多摸五张）；2.其失去1点体力，然后获得你弃置的牌。",
	qj_hongyan: "红颜",
	qj_hongyan_info: "锁定技，你的黑桃牌和黑桃判定牌视为红桃牌。",
	qj_tianyi: "天义",
	qj_tianyi_info:
		"出牌阶段限一次，你可以与一名角色拼点。若你赢，本回合你使用【杀】无距离限制、可多指定一个目标且可多使用一张【杀】；若你没赢，本回合你不能使用【杀】。",
	qj_hanzhan: "酣战",
	qj_hanzhan_info: "你拼点后，你可以获得拼点牌之中点数最大的【杀】。",
	tl_taishici: "统领【杀】",
	tl_taishici_info:
		"【杀】（限一）|曲阿小将：锁定技，当你使用【杀】指定目标后，你视为装备着所有目标的武器且无视其防具，直到此【杀】结算结束。",
	qj_buqu: "不屈",
	qj_buqu_info:
		"锁定技，当你进入濒死状态时，你摸X张牌，将X张牌置于武将牌上（X为你本回合濒死的次数），称为“创”，然后移去至每种花色各一张，若你未移去牌，则回复体力至1点。",
	qj_fenji: "奋激",
	qj_fenji_info:
		"每回合结束时，你可以令一名本回合失去过所有手牌的角色摸两张牌，然后你失去1点体力。",
	qj_haoshi: "好施",
	qj_haoshi_info:
		"摸牌阶段，你可以多摸两张牌，然后若你的手牌数大于5，你将半数（向下取整）手牌交给一名手牌最少的其他角色。",
	qj_dimeng: "缔盟",
	qj_dimeng_info:
		"出牌阶段限一次，你可以选择两名其他角色并弃置等同其手牌数差的牌，令其交换手牌，你可以对其中手牌未增加的角色纵横“好施”。",
	qj_zhijian: "直谏",
	qj_zhijian_info:
		"出牌阶段，你可以将一张装备牌置于一名其他角色的装备区，然后摸一张牌。",
	qj_guzheng: "固政",
	qj_guzheng_info:
		"每回合限一次，当其他角色的至少两张牌因弃置而置入弃牌堆后，你可以将其中一张牌交给其，然后你获得其余至多三张牌。",
	qj_duanbing: "短兵",
	qj_duanbing_info:
		"你使用【杀】时可以多指定一名距离为1的角色为目标。当你使用【杀】指定唯一目标后，目标角色需多使用一张【闪】才能抵消。",
	qj_fenxun: "奋迅",
	qj_fenxun_info:
		"出牌阶段限一次，你可以弃置一张牌并指定一名其他角色，你与该角色本回合的距离视为1。",
	qj_jishi: "济世",
	qj_jishi_info:
		"你可以将红色牌当【桃】对濒死角色使用，此濒死结算后，若此武将为客将，与你势力不同的角色依次选择是否用一个武将交换此武将。",
	qj_chuli: "除疠",
	qj_chuli_info:
		"出牌阶段限一次，你可以选择至多三名势力各不相同的其他角色，弃置你和这些角色各一张牌，然后以此法失去黑桃牌的角色各摸一张牌。",
	qj_wushuang: "无双",
	qj_wushuang_info:
		"锁定技，当你使用【杀】指定目标后，你令此【杀】需两张【闪】才能抵消；当你使用【决斗】指定目标后，或成为【决斗】的目标后，与你【决斗】的角色每次需打出两张【杀】。",
	qj_xiaomeng: "虓猛",
	qj_xiaomeng_info:
		"每回合限一次，当你使用【决斗】时，当前回合角色可以为此牌多指定至多两个目标。",
	tl_lvbu: "统领【杀】",
	tl_lvbu_info:
		"【杀】|并州狼骑：出牌阶段限一次，你可以令一名其他角色视为对你使用一张【决斗】，本回合你与其距离视为1。",
	qj_lijian: "离间",
	qj_lijian_info:
		"出牌阶段限一次，你可以弃置一张牌并选择两名其他男性角色，令其中一名角色视为对其中另一名角色使用一张【决斗】（不可被抵消）。",
	qj_biyue: "闭月",
	qj_biyue_info: "结束阶段，你可以摸一张牌，若你没有手牌，改为摸两张牌。",
	qj_luanji: "乱击",
	qj_luanji_info:
		"你可以将两张手牌当【万箭齐发】使用（不能选择本回合发动此技能时已选择过的花色），与你势力相同的角色打出【闪】响应此牌后，其可以摸一张牌。",
	qj_shuangxiong: "双雄",
	qj_shuangxiong_info:
		"摸牌阶段结束时，你可以弃置一张牌，若如此做，本回合你可以将一张与此牌颜色不同的牌当【决斗】使用。结束阶段，你可以从弃牌堆获得所有本回合对你造成过伤害的牌。",
	qj_wansha: "完杀",
	qj_wansha_info:
		"锁定技，有角色于你回合内进入濒死时，除其外的其他角色于结算中不能对其使用【桃】。",
	qj_luanwu: "乱武",
	qj_luanwu_info:
		"限定技，出牌阶段，你可以令所有其他角色各选择一项：1.对其距离最小的另一名角色使用一张【杀】；2.失去1点体力。",
	qj_weimu: "帷幕",
	qj_weimu_info: "锁定技，你成为黑色锦囊牌的目标时，取消之。",
	qj_menghan: "猛撼",
	qj_menghan_info:
		"当你使用【杀】指定一个目标后，你可以弃置其一张牌，若为装备牌，则此【杀】不能被其响应，否则其获得此【杀】。",
	qj_leiji: "雷击",
	qj_leiji_info:
		"当你使用或打出【闪】时，你可令一名其他角色判定，若为：黑桃，你对其造成2点雷电伤害；梅花，你回复1点体力，对其造成1点雷电伤害。",
	qj_guidao: "鬼道",
	qj_guidao_info: "当一张判定牌生效前，你可以打出一张黑色牌替换之。",
	tl_zhangjiao: "统领【勠力同心】",
	tl_zhangjiao_info:
		"【勠力同心】|黄巾雷使：每回合首次有角色不因使用手牌而造成伤害时，你可以弃置一张手牌并判定，若为：黑色，此伤害+1；红色，其获得此判定牌。",
	qj_beige: "悲歌",
	qj_beige_info:
		"当一名角色受到【杀】造成的伤害后，你可以弃置一张牌，然后令其判定，若为：红桃，其回复1点体力；方片，其摸两张牌；梅花，来源弃置两张牌；黑桃，来源叠置。",
	qj_duanchang: "断肠",
	qj_duanchang_info: "锁定技，你死亡时，你令来源失去一张武将牌的技能。",
	qj_xiongyi: "雄异",
	qj_xiongyi_info:
		"限定技，出牌阶段，你可以令所有与你势力相同的角色各摸三张牌，然后若与你势力相同的角色数最小，你回复1点体力。",
	qj_shuangren: "双刃",
	qj_shuangren_info:
		"出牌阶段开始时，你可以与一名角色拼点：若你赢，你视为对包含其在内的至多两名角色使用一张【杀】；若你没赢，本回合你手牌中的【杀】只能当【借刀杀人】使用。",
	qj_sijian: "死谏",
	qj_sijian_info:
		"当你失去最后的手牌后，或当你的体力值变化为1后，你可以弃置一名其他角色的一张牌。",
	qj_suishi: "随势",
	qj_suishi_info:
		"锁定技，其他角色进入濒死时，若来源与你势力相同，你摸一张牌；与你势力相同的其他角色死亡时，你失去1点体力或弃置所有手牌。",
	qj_kuangfu: "狂斧",
	qj_kuangfu_info:
		"出牌阶段限一次，你可以弃置场上一张装备牌并视为使用一张无距离限制的【杀】，然后若弃置的不是你的牌且此【杀】未造成伤害，你弃置两张手牌；若弃置的是你的牌且此【杀】造成伤害，你摸两张牌。",
	qj_huoshui: "祸水",
	qj_huoshui_info:
		"你的回合内，其他角色不能明置其武将牌；出牌阶段，你可以弃置一张黑色牌并暗置一名武将牌均明置的其他角色一张武将牌，然后其交给你一张牌。",
	qj_qingcheng: "倾城",
	qj_qingcheng_info:
		"出牌阶段限一次，你可以选择一名手牌数小于等于你的其他男性角色，你与其交换手牌。",
	qj_xiaoni: "骁逆",
	qj_xiaoni_info:
		"限定技，出牌阶段，你可以视为对任意名其他势力的角色使用一张【杀】，然后弃置其中一名未以此法受到伤害的角色三张牌。",
	qj_chuitong: "垂统",
	qj_chuitong_info:
		"其他角色进入濒死状态时，你可以将其装备区的一张牌移动至你装备区。",
	qj_xingtu: "兴图",
	qj_xingtu_info:
		"每回合结束时，若本回合有应变牌被使用过，你可以选择一项：1.将一张装备牌当【桃】对一名角色使用；2.摸一张牌。",
	qj_tairan: "泰然",
	qj_tairan_info:
		"出牌阶段开始时，你可以失去任意点体力，且可以弃置至多等同已损失体力值的牌。若如此做，结束阶段，你回复以此法失去的体力，摸等同以此法弃牌数的牌。",
	qj_yimie: "夷灭",
	qj_yimie_info:
		"限定技，当你对体力值大于等于你的角色造成伤害时，你可以令此伤害翻倍。",
	tl_simashi: "统领【出其不意】",
	tl_simashi_info:
		"♥【出其不意】|腹心死士：与你势力相同的角色回合结束时，若其有未发动的限定技，你可以摸一张牌，交给其一张牌；若其本回合发动过限定技，你可以视为对其攻击范围内的一名角色使用【杀】。",
	qj_choufa: "筹伐",
	qj_choufa_info:
		"出牌阶段限一次，你可以展示一名其他角色的一张手牌，然后令其此阶段内与此牌类别不同的手牌均视为【杀】。",
	qj_zhaoran: "昭然",
	qj_zhaoran_info:
		"出牌阶段开始时，你可以令此阶段内你的手牌对所有角色可见，且你首次失去每种花色最后的手牌后，摸一张牌或弃置其他角色一张牌。",
	qj_tongfa: "通法",
	qj_tongfa_info:
		"与你势力相同的角色使用应变牌时，其可以交给你（若为你则改为弃置）一张牌并触发应变。",
	qj_beishi: "悖弑",
	qj_beishi_info:
		"当你成为其他角色的非回复牌的唯一目标时，你可以弃置一张同类别牌并取消之，然后获得之；若此牌非转化，你对其使用之；若你未以此法使用牌对其造成伤害，你失去1点体力。",
	qj_rouke: "柔克",
	qj_rouke_info:
		"与你势力相同的角色每回合使用首张【杀】可以改为冰【杀】，结算后若此牌未造成伤害，你可以令至多两名角色横置或重置。你的手牌上限+X（X为横置的角色数）。",
	qj_shunliu: "顺流",
	qj_shunliu_info:
		"当你造成属性伤害后，你可以依次弃置所有横置的角色各一张牌。",
	qj_shiren: "识人",
	qj_shiren_info:
		"准备阶段，你可以选择至多三名其他势力角色各一张手牌，这些角色依次声明一个牌名，然后你展示并获得其中一张被选择的牌，若牌名与其声明不同，你获得其余被选择的牌。",
	qj_jiexia: "接下",
	qj_jiexia_info:
		"每回合限一次，明置武将牌数小于你的角色受到伤害后，你可以交给其两张牌并摸两张牌。",
	qj_yishi: "宜室",
	qj_yishi_info:
		"每回合限一次，与你势力相同的角色弃置任意角色的牌后，你可以将其中一张交给其，然后你获得其余一张牌。",
	qj_shidu: "识度",
	qj_shidu_info:
		"出牌阶段限一次，你可以与一名角色拼点。若你赢，你获得其所有手牌，然后你将半数手牌（向下取整）交给其。",
	qj_quanbian: "权变",
	qj_quanbian_info:
		"当你于出牌阶段内第一次使用每种花色的手牌时，你可以令你此阶段不能再使用此花色的手牌，然后卜算3并摸一张牌。",
	qj_zhouting: "骤霆",
	qj_zhouting_info:
		"限定技，出牌阶段，你可以连续亮出且使用牌堆顶牌，直到无法使用或亮出牌数达到角色数，",
	tl_jin_simayi: "统领【调虎离山】",
	tl_jin_simayi_info:
		"【调虎离山】|腹心死士：与你势力相同的角色回合结束时，若其有未发动的限定技，你可以摸一张牌，交给其一张牌；若其本回合发动过限定技，你可以视为对其攻击范围内的一名角色使用【杀】。",
	qj_shangshi: "伤逝",
	qj_shangshi_info:
		"一名角色的结束阶段，你可以选择一项：1.若其手牌数大于你，将任意张牌当【杀】对其使用；2.摸牌至你已损失的体力值。",
	qj_ejue: "扼绝",
	qj_ejue_info:
		"当你造成伤害时，若你没有手牌，你可以失去一个技能或珠联璧合标记，然后令此伤害翻倍且改为冰冻伤害。",
	qj_guoyi: "果毅",
	qj_guoyi_info:
		"出牌阶段限一次，你可以弃置至多三张基本牌并令等量名有牌的其他角色各选择一项：1.你弃置其装备区一张牌；2.你获得其一张手牌。这些角色选择完成后，若两项均被选择过，你可以对其中一名角色造成1点伤害。",
	qj_ciwei: "慈威",
	qj_ciwei_info:
		"当一名角色于其回合内使用第二张牌时，你可以弃置一张牌，若其使用牌为基本或普通锦囊牌，则令此牌对任意目标无效，否则其横置。",
	qj_caiyuan: "才媛",
	qj_caiyuan_info:
		"锁定技，与你势力相同的角色的结束阶段，若其:已受伤，你令其摸一张牌;已横置，你令其重置并摸一张牌。",
	qj_chengliu: "乘流",
	qj_chengliu_info:
		"你的伤害牌具有<富甲→改为雷电伤害>，且结算后你可以横置任意名受到此牌伤害的角色。",
	qj_keqing: "克清",
	qj_keqing_info:
		"出牌阶段限一次，你可以选择一名已横置的其他角色，直到你再发动此技能或死亡：当其使用或打出牌时，若其横置，其弃置一张牌。",
	qj_lvli: "膂力",
	qj_lvli_info:
		"每回合限一次，当你造成伤害后，你可以选择一项：1.摸牌至体力值；2.弃置所有手牌，然后回复体力至X点（X为以此法弃置的牌数）。",
	qj_duoqi: "夺气",
	qj_duoqi_info:
		"限定技，一名角色的回合结束时，若你或其没有手牌，你可以获得一个额外的回合。",
	tl_wenyang: "统领 冰【杀】",
	tl_wenyang_info:
		"冰【杀】（限一）|文虎：出牌阶段限一次，你可以弃置任意个区域的所有牌，然后视为使用目标上限为X的【决斗】（X为你以此法弃置牌的区域数）。",
	qj_qianqu: "前驱",
	qj_qianqu_info:
		"与你势力相同的角色准备阶段，你可以使用一张无距离限制的【杀】<助战→弃置目标角色装备区里的一张牌>，然后若此【杀】造成伤害，当前回合角色获得此【杀】并摸一张牌。",
	qj_fuli: "复礼",
	qj_fuli_info:
		"与你势力相同的角色摸牌阶段，其可以多摸一张牌并展示一张手牌，将此牌交给你，本回合其不能使用或打出展示花色的牌。",
	qj_fengwu: "风物",
	qj_fengwu_info:
		"出牌阶段限一次，你可以令至多三名角色选择是否使用一张牌。结算后若本回合所有花色的牌均被使用过，你摸两张牌并回复1点体力。",
	qj_tianming: "天命",
	qj_tianming_info:
		"当你成为【杀】的目标后，你可以弃置两张手牌（不足则全弃，无牌则不弃），摸两张牌。",
	qj_mizhao: "密诏",
	qj_mizhao_info:
		"出牌阶段限一次，你可以将X张牌交给一名其他角色（X为与你不同的势力数），然后令其与另一名由你选择的其他角色拼点：赢的角色视为对没赢的角色使用一张【杀】。",
	qj_shiyuan: "诗怨",
	qj_shiyuan_info:
		"每回合各限一次，当你成为其他角色使用牌的目标后，若其体力值：大于你，你可以摸两张牌；小于等于你，你可以摸一张牌。",
	qj_dushi: "毒逝",
	qj_dushi_info:
		"锁定技，其他角色不能对你使用【桃】；你死亡时，来源获得此技能。",
	qj_taoluan: "滔乱",
	qj_taoluan_info:
		"当你需要使用任意一种基本或普通锦囊牌时，你可以明置此武将牌并视为使用之。当前回合结束时，你选择本回合以此法使用牌指定过的至多三名其他角色，其依次展示并交给你一张手牌，若红色多于黑色，你暗置一张武将牌。",
	qj_mouzhu: "谋诛",
	qj_mouzhu_info:
		"出牌阶段限一次，你可以令一名其他角色交给你一张手牌，然后若其手牌数小于你，其视为使用一张【杀】或【决斗】。",
	qj_gounan: "构难",
	qj_gounan_info:
		"锁定技，你死亡后，直到当前回合角色下回合开始，与你势力相同的角色对来源势力角色使用【杀】造成伤害时，此伤害+1。",
	qj_lianji: "连计",
	qj_lianji_info:
		"出牌阶段每名角色限一次，你可以交给其他角色一张手牌，令其本回合下次受到的伤害+1。",
	qj_dingzhu: "定著",
	qj_dingzhu_info:
		"出牌阶段结束时，你可以选择一名本回合获得过牌的其他角色，其视为使用一张【决斗】。",
	qj_minsi: "敏思",
	qj_minsi_info:
		"出牌阶段限一次，你可以弃置至多三张点数之和为13的牌，展示牌堆顶两倍的牌并获得之，本回合你以此法获得的红桃牌不计入手牌上限。",
	qj_fusong: "赋颂",
	qj_fusong_info:
		"你死亡后，你可以令一名与你势力相同的其他角色获得你以此法弃置的红桃牌并摸等量的牌。",
	qj_zhuikong: "惴恐",
	qj_zhuikong_info:
		"其他角色的准备阶段，若你已受伤，你可以与其拼点。若你赢，防止其本回合造成伤害；若你没赢，其可以视为对你使用一张【杀】。",
	qj_qiuyuan: "求援",
	qj_qiuyuan_info:
		"当你成为其他角色使用【杀】的目标时，你可以令另一名其他角色也成为目标且优先结算，此【杀】被抵消后对其余目标无效。",
	qj_moukui: "谋溃",
	qj_moukui_info:
		"当你使用【杀】指定目标后，你可以选择一个目标并选择一至两项：1.摸一张牌；2.弃置其一张牌。若你选择了两项，当其抵消此【杀】时，其弃置你一张牌。",
	tl_fuwan: "统领【闪】",
	tl_fuwan_info:
		"【闪】（限一）|穆顺：每回合限一次，当你弃置任意角色的牌或被其他角色弃置牌后，你可以获得其中一张。若如此做，本回合你下次弃置任意角色的牌或被其他角色弃置牌后，你失去1点体力。",
	qj_chengzhao: "承诏",
	qj_chengzhao_info:
		"每名角色的结束阶段，若你本回合得到过至少两张牌，你可以与一名角色拼点：若你赢，你视为对其使用一张无视防具的【杀】。",
	qj_aiwu: "哀舞",
	qj_aiwu_info:
		"每回合限一次，当其他角色受到伤害后，你可以弃置至少一张牌，然后其可以弃置至少一张牌，若你与其共计弃置的牌数达到三张，你与其各回复1点体力。",
	qj_juebie: "诀别",
	qj_juebie_info:
		"与你势力相同的角色死亡时，其可以令另一名与你势力相同的角色获得其所有牌或摸三张牌。",
	qj_zhudian: "铸典",
	qj_zhudian_info:
		"当你成为其他角色使用黑色牌的目标后，你可以重铸一张牌，然后若你摸到的牌为黑色的另一种花色，你可以展示之并额外摸一张牌。",
	qj_botong: "博通",
	qj_botong_info:
		"你可以将四张花色各不同的牌当任意一种基本牌使用，然后你可以将这些牌交给其他角色。",
	qj_fenyue: "奋钺",
	qj_fenyue_info:
		"出牌阶段限X次（X为与你不同的势力数），你可以与一名角色拼点：若你赢，其不能响应你本回合使用的下一张牌，且若你的拼点牌点数小于9，你视为对其使用一张火【杀】；若你没赢，本回合此技能失效。",
	qj_jingnu: "劲弩",
	qj_jingnu_info:
		"出牌阶段结束时，若你此阶段使用过的牌均为【杀】，或使用的最后两张牌均不为【杀】，你可以视为使用一张【杀】。",
	qj_weitun: "威屯",
	qj_weitun_info:
		"限定技，弃牌阶段开始前，若你的手牌最多，你可以跳过此阶段，然后视为对任意名角色使用【桃园结义】和【五谷丰登】。",
	qj_kannan: "戡难",
	qj_kannan_info:
		"出牌阶段每势力限一次，你可以与一名角色拼点：赢的角色可以获得没赢的拼点牌并令你本回合使用下张【杀】伤害+1，若你赢，你本回合不能再发动此技能。",
	qj_niju: "逆拒",
	qj_niju_info:
		"锁定技，当你拼点没赢后，你本回合拼点牌点数+3，若对方也没赢，你摸一张牌。",
	qj_jibing: "集兵",
	qj_jibing_info:
		"摸牌阶段，你可以多摸X张牌（X为与你势力相同的角色数）。若如此做，回合结束时，若你本回合造成伤害值小于X，你失去1点体力。",
	tl_jianshuo: "统领【闪】",
	tl_jianshuo_info:
		"【闪】|西园军：与你势力相同的角色出牌阶段开始时，你可以选择一名角色的一张手牌，本回合此牌对所有角色可见且其不能使用或打出之，其受到伤害后来源获得之。",
	qj_niujin: "翼从：牛金",
	qj_niujin_info:
		"与你势力相同的角色回合结束时，你可以使用每种类别至多各一张牌，你以此法杀死角色后摸三张牌。",
	qj_zhoucang: "翼从：周仓",
	qj_zhoucang_info:
		"当你使用【杀】后，你可以将此【杀】或目标角色使用的【闪】交给另一名其他角色，若其以此法获得红色牌，其可以对你攻击范围内的一名角色使用一张【杀】。",
	qj_quexiaojiang: "翼从：曲阿小将",
	qj_quexiaojiang_info:
		"每回合限一次，当你使用牌后，若此牌目标与你本回合使用的上一张牌不完全相同，你可以对这两张牌的重合目标各造成1点伤害。",
	qj_wenhu: "翼从：文虎",
	qj_wenhu_info:
		"出牌阶段限一次，你可以弃置任意个区域的所有牌，然后视为使用目标上限为X的【决斗】（X为你以此法弃置牌的区域数）。",
	qj_mushun: "翼从：穆顺",
	qj_mushun_info:
		"每回合限一次，当你弃置任意角色的牌或被其他角色弃置牌后，你可以获得其中一张。若如此做，本回合你下次弃置任意角色的牌或被其他角色弃置牌后，你失去1点体力。",
	qj_huweijun: "翼从：虎卫军",
	qj_huweijun_info:
		"每回合结束时，若你本回合共计造成和受到过的伤害数大于1，你可以移动场上一张牌。",
	qj_baimayicong: "翼从：白马义从",
	qj_baimayicong_info: "当你使用或打出【闪】时，你可以获得对方的一张牌。",
	qj_xiangbing: "翼从：象兵",
	qj_xiangbing_info:
		"锁定技，当你使用【杀】后，你视为对受到此【杀】伤害的目标角色使用一张【南蛮入侵】；当你受到火焰伤害后，你视为对所有相邻角色使用一张【杀】。",
	qj_jinfanjun: "翼从：锦帆军",
	qj_jinfanjun_info:
		"每回合每颜色限一次，你弃置任意角色的牌后，你可以弃置一张其中包含的颜色的牌，然后摸两张牌。",
	qj_bingzhoulangqi: "翼从：并州狼骑",
	qj_bingzhoulangqi_info:
		"出牌阶段限一次，你可以令一名其他角色视为对你使用一张【决斗】，本回合你与其距离视为1。",
	qj_huangjinleishi: "翼从：黄巾雷使",
	qj_huangjinleishi_info:
		"每回合首次有角色不因使用手牌而造成伤害时，你可以弃置一张手牌并判定，若为：黑色，此伤害+1；红色，其获得此判定牌。",
	qj_xiliangjingqi: "翼从：西凉精骑",
	qj_xiliangjingqi:
		"结束阶段，你可以使用一张【杀】；当你使用【杀】指定攻击范围内没有你的角色为目标后，你可以令其弃置一张牌。",
	qj_fuxinsishi: "翼从：腹心死士",
	qj_fuxinsishi_info:
		"与你势力相同的角色回合结束时，若其有未发动的限定技，你可以摸一张牌，交给其一张牌；若其本回合发动过限定技，你可以视为对其攻击范围内的一名角色使用【杀】。",
	qj_xiyuanjun: "翼从：西园军",
	qj_xiyuanjun_info:
		"与你势力相同的角色出牌阶段开始时，你可以选择一名角色的一张手牌，本回合此牌对所有角色可见且其不能使用或打出之，其受到伤害后来源获得之。",
	sha_qj_choufa: "筹伐",
	visible_qj_zhaoran: "可见",
	heart_qj_minsi:"敏思",
	visible_qj_xiyuanjun: "可见",
	qj_huoji_zongheng_info:
		"你可以将一张红色手牌当【火攻】使用。",
};

export default translate;
